lvx/base/InformationRegisters/бит_вго_СоответствиеОперацийВГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_вго_СоответствиеОперацийВГО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОперацияПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_вго_ОперацииВГО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОперацияПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_вго_ОперацииВГО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_вго_ВидыОперацийВГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_вго_ВидыОперацийВГО</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОперацияПоставщика</Name>
					<Comment>Операция поставщика</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияПокупателя</Name>
					<Comment>Операция покупателя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Техническая</Name>
					<Comment>Техническая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/InformationRegisters/бит_вго_СоответствиеОперацийВГО/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли;
	
	ВидыОпераций = Перечисления.бит_вго_ВидыОперацийВГО;

	Если ЭтотОбъект.Количество() <> 0 Тогда
        
        ТаблицаДляПроверки = ЭтотОбъект.Выгрузить();
		
		Для каждого СтрокаТаблицы Из ТаблицаДляПроверки Цикл
			
			Если СтрокаТаблицы.ОперацияПоставщика.ВидОперации = ВидыОпераций.Остатки
				ИЛИ СтрокаТаблицы.ОперацияПоставщика.ВидОперации = ВидыОпераций.Техническая 
				ИЛИ СтрокаТаблицы.ОперацияПокупателя.ВидОперации = ВидыОпераций.Остатки
				ИЛИ СтрокаТаблицы.ОперацияПокупателя.ВидОперации = ВидыОпераций.Техническая
				ИЛИ СтрокаТаблицы.ОперацияПоставщика.ВидОперации = ВидыОпераций.ОперацияПокупателя
				ИЛИ СтрокаТаблицы.ОперацияПокупателя.ВидОперации = ВидыОпераций.ОперацияПоставщика Тогда
			
				Отказ = Истина;				 
				 
				ТекстСообщения = Нстр("ru='Невозможно записать соответствие. Некорректные значения операций.';
									  |en='Unable to record compliance. Incorrect operation values'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Прервать;
				
			КонецЕсли;
			    		
		КонецЦикла;
		
		МассивОперацийПоставщика = ТаблицаДляПроверки.ВыгрузитьКолонку("ОперацияПоставщика");
		МассивОперацийПокупателя = ТаблицаДляПроверки.ВыгрузитьКолонку("ОперацияПокупателя");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивОперацийПоставщика", МассивОперацийПоставщика);
		Запрос.УстановитьПараметр("МассивОперацийПокупателя", МассивОперацийПокупателя);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СоответствиеОперацийВГО.ОперацияПоставщика,
		|	СоответствиеОперацийВГО.ОперацияПокупателя
		|ИЗ
		|	РегистрСведений.бит_вго_СоответствиеОперацийВГО КАК СоответствиеОперацийВГО
		|ГДЕ
		|	(СоответствиеОперацийВГО.ОперацияПоставщика В(&МассивОперацийПоставщика)
		|			ИЛИ СоответствиеОперацийВГО.ОперацияПокупателя В(&МассивОперацийПокупателя))
		|";
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Отказ = Истина;
			
			ТекстСообщения = Нстр("ru='Невозможно записать соответствие. Значения операций уже участвуют в записанных соответствиях.';
								  |en='Unable to record compliance. Operation values are already involved in recorded compliances.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
											
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
